                                                    E-Commerce Analysis

Import data

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import plotly.express as px
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df=pd.read_csv('ecommerce_realistic_100k_messy.csv')
df

,CustomerID,CustomerName,Gender,Age,Country,OrderID,OrderDate,ProductCategory,ProductName,Price,...,DiscountRate,HasDiscountApplied,TotalAmount,PaymentMethod,DeviceType,ReferralSource,SessionDuration,CustomerTenureDays,ReviewScore,ReviewText
0,C132389,Anil Singh,Female,18.0,USA,O278302,27-02-2024,Clothing,Zara Casual Shirt,2196.74,...,0.0,FALSE,2196.74,Netbanking,Mobile,Organic,970.0,423.0,5.0,NaN
1,C133143,Karan Nair,Male,40.0,USA,O266464,25-12-2024,Clothing,Zara Casual Shirt,1843.29,...,0.0,FALSE,1843.29,Netbanking,Mobile,Search,240.0,917.0,3.0,Okay product
2,C105591,Aisha Varma,Female,40.0,Germany,O293227,23-04-2024,Electronics,Apple iPad 10th,26148.78,...,0.0,FALSE,26148.78,UPI,Mobile,Email,233.0,560.0,5.0,Very satisfied
3,C106172,Hemender Mehta,Male,18.0,UK,O201747,20-02-2024,Electronics,Apple iPad 10th,29340.19,...,0.0,FALSE,29340.19,UPI,Mobile,Ad,163.0,91.0,4.0,NaN
4,C134744,Vikram Mehta,Female,36.0,UK,O280004,25-02-2024,Electronics,Apple iPad 10th,24367.64,...,0.0,FALSE,24367.64,UPI,Mobile,Friend,149.0,11.0,4.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
100495,C140533,Fatima Nair,Male,18.0,UK,O206265,18-06-2024,Electronics,Apple iPad 10th,29838.26,...,5.0,TRUE,28346.35,UPI,Mobile,Organic,185.0,621.0,5.0,Great product
100496,C138850,Aisha Das,Female,44.0,Canada,O254886,16-02-2024,Clothing,Zara Casual Shirt,1828.11,...,0.0,FALSE,1828.11,UPI,Mobile,Social,204.0,8.0,3.0,NaN
100497,C110615,Aisha Joseph,Male,47.0,India,O276820,25-12-2024,Furniture,Office Ergonomic Chair,9024.69,...,5.0,TRUE,8573.46,UPI,Mobile,Friend,185.0,92.0,4.0,NaN
100498,C125593,Vikram Reddy,Female,37.0,USA,O200860,24-12-2024,Clothing,Nike Running Shoes,3915.72,...,0.0,FALSE,15662.88,UPI,Desktop,Social,170.0,207.0,3.0,Nothing special
100499,C106543,Fatima Sharma,Male,30.0,USA,O215795,28-02-2024,Electronics,"LG TV 43""",15336.55,...,20.0,TRUE,36807.72,Card,Mobile,Ad,135.0,45.0,5.0,NaN

Data Preparation & Cleaning

In [3]:
df.head()

,CustomerID,CustomerName,Gender,Age,Country,OrderID,OrderDate,ProductCategory,ProductName,Price,...,DiscountRate,HasDiscountApplied,TotalAmount,PaymentMethod,DeviceType,ReferralSource,SessionDuration,CustomerTenureDays,ReviewScore,ReviewText
0,C132389,Anil Singh,Female,18.0,USA,O278302,27-02-2024,Clothing,Zara Casual Shirt,2196.74,...,0.0,FALSE,2196.74,Netbanking,Mobile,Organic,970.0,423.0,5.0,NaN
1,C133143,Karan Nair,Male,40.0,USA,O266464,25-12-2024,Clothing,Zara Casual Shirt,1843.29,...,0.0,FALSE,1843.29,Netbanking,Mobile,Search,240.0,917.0,3.0,Okay product
2,C105591,Aisha Varma,Female,40.0,Germany,O293227,23-04-2024,Electronics,Apple iPad 10th,26148.78,...,0.0,FALSE,26148.78,UPI,Mobile,Email,233.0,560.0,5.0,Very satisfied
3,C106172,Hemender Mehta,Male,18.0,UK,O201747,20-02-2024,Electronics,Apple iPad 10th,29340.19,...,0.0,FALSE,29340.19,UPI,Mobile,Ad,163.0,91.0,4.0,NaN
4,C134744,Vikram Mehta,Female,36.0,UK,O280004,25-02-2024,Electronics,Apple iPad 10th,24367.64,...,0.0,FALSE,24367.64,UPI,Mobile,Friend,149.0,11.0,4.0,NaN

In [4]:
df.shape

(100500, 21)

In [5]:
df.describe()

,Age,Price,Quantity,DiscountRate,TotalAmount,SessionDuration,CustomerTenureDays,ReviewScore
count,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000
mean,32.225189,12969.015061,1.373490,3.732758,16636.518828,322.946302,402.047919,3.629075
std,9.410431,14705.752729,0.799082,5.572621,23898.641885,297.289047,403.322816,1.108081
min,18.000000,255.050000,1.000000,0.000000,204.380000,16.191353,0.000000,0.919006
25%,25.000000,1896.890000,1.000000,0.000000,2085.767500,112.000000,115.000000,3.000000
50%,32.000000,7769.295000,1.000000,0.000000,8025.115000,231.000000,278.000000,4.000000
75%,39.000000,18445.222500,1.000000,5.000000,22620.780000,436.000000,556.000000,4.000000
max,81.772819,74911.034740,5.883613,28.270089,249669.520000,3465.000000,6287.000000,5.000000

In [6]:
df.isnull().sum()

CustomerID                0
CustomerName            966
Gender                    0
Age                       0
Country                   0
OrderID                   0
OrderDate                 0
ProductCategory           0
ProductName             975
Price                     0
Quantity                  0
DiscountRate              0
HasDiscountApplied        0
TotalAmount               0
PaymentMethod          1010
DeviceType                0
ReferralSource            0
SessionDuration           0
CustomerTenureDays        0
ReviewScore               0
ReviewText            58538
dtype: int64

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100500 entries, 0 to 100499
Data columns (total 21 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   CustomerID          100500 non-null  object
 1   CustomerName        99534 non-null   object
 2   Gender              100500 non-null  object
 3   Age                 100500 non-null  float64
 4   Country             100500 non-null  object
 5   OrderID             100500 non-null  object
 6   OrderDate           100500 non-null  object
 7   ProductCategory     100500 non-null  object
 8   ProductName         99525 non-null   object
 9   Price               100500 non-null  float64
 10  Quantity            100500 non-null  float64
 11  DiscountRate        100500 non-null  float64
 12  HasDiscountApplied  100500 non-null  object
 13  TotalAmount         100500 non-null  float64
 14  PaymentMethod       99490 non-null   object
 15  DeviceType          100500 non-null  object
 16  ReferralSource      100500 non-null  object
 17  SessionDuration     100500 non-null  float64
 18  CustomerTenureDays  100500 non-null  float64
 19  ReviewScore         100500 non-null  float64
 20  ReviewText          41962 non-null   object
dtypes: float64(8), object(13)
memory usage: 16.1+ MB

First lets clean Data for easier analysis

In [8]:
df.describe()

,Age,Price,Quantity,DiscountRate,TotalAmount,SessionDuration,CustomerTenureDays,ReviewScore
count,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000
mean,32.225189,12969.015061,1.373490,3.732758,16636.518828,322.946302,402.047919,3.629075
std,9.410431,14705.752729,0.799082,5.572621,23898.641885,297.289047,403.322816,1.108081
min,18.000000,255.050000,1.000000,0.000000,204.380000,16.191353,0.000000,0.919006
25%,25.000000,1896.890000,1.000000,0.000000,2085.767500,112.000000,115.000000,3.000000
50%,32.000000,7769.295000,1.000000,0.000000,8025.115000,231.000000,278.000000,4.000000
75%,39.000000,18445.222500,1.000000,5.000000,22620.780000,436.000000,556.000000,4.000000
max,81.772819,74911.034740,5.883613,28.270089,249669.520000,3465.000000,6287.000000,5.000000

In [9]:
df['CustomerID']

0         C132389
1         C133143
2         C105591
3         C106172
4         C134744
           ...
100495    C140533
100496    C138850
100497    C110615
100498    C125593
100499    C106543
Name: CustomerID, Length: 100500, dtype: object

In [10]:
df['CustomerID'].isnull().sum()

np.int64(0)

In [11]:
df['CustomerID'].nunique()

45764

In [12]:
df['CustomerID'].dtype

dtype('O')

In [13]:
df['CustomerID']=df['CustomerID'].astype(str).str.strip().str.title()

In [14]:
df['CustomerID']

0         C132389
1         C133143
2         C105591
3         C106172
4         C134744
           ...
100495    C140533
100496    C138850
100497    C110615
100498    C125593
100499    C106543
Name: CustomerID, Length: 100500, dtype: object

In [15]:
df['CustomerName']

0             Anil Singh
1             Karan Nair
2            Aisha Varma
3         Hemender Mehta
4           Vikram Mehta
               ...
100495       Fatima Nair
100496         Aisha Das
100497      Aisha Joseph
100498     Vikram  Reddy
100499     Fatima Sharma
Name: CustomerName, Length: 100500, dtype: object

In [16]:
df['CustomerName']=df['CustomerName'].astype(str).str.strip().str.title()

In [17]:
df['CustomerName']

0             Anil Singh
1             Karan Nair
2            Aisha Varma
3         Hemender Mehta
4           Vikram Mehta
               ...
100495       Fatima Nair
100496         Aisha Das
100497      Aisha Joseph
100498     Vikram  Reddy
100499     Fatima Sharma
Name: CustomerName, Length: 100500, dtype: object

In [18]:
df['CustomerName']

0             Anil Singh
1             Karan Nair
2            Aisha Varma
3         Hemender Mehta
4           Vikram Mehta
               ...
100495       Fatima Nair
100496         Aisha Das
100497      Aisha Joseph
100498     Vikram  Reddy
100499     Fatima Sharma
Name: CustomerName, Length: 100500, dtype: object

In [19]:
df['CustomerName'].isnull().sum()

np.int64(0)

In [20]:
df['CustomerName']

0             Anil Singh
1             Karan Nair
2            Aisha Varma
3         Hemender Mehta
4           Vikram Mehta
               ...
100495       Fatima Nair
100496         Aisha Das
100497      Aisha Joseph
100498     Vikram  Reddy
100499     Fatima Sharma
Name: CustomerName, Length: 100500, dtype: object

In [21]:
df.iloc[291]

CustomerID                      C121856
CustomerName                        Nan
Gender                             Male
Age                                18.0
Country                          Canada
OrderID                         O204881
OrderDate                    04-07-2024
ProductCategory                Clothing
ProductName           Zara Casual Shirt
Price                           2176.68
Quantity                            1.0
DiscountRate                        0.0
HasDiscountApplied                FALSE
TotalAmount                     2176.68
PaymentMethod                       UPI
DeviceType                       Mobile
ReferralSource                   Friend
SessionDuration                    39.0
CustomerTenureDays                653.0
ReviewScore                         1.0
ReviewText                          NaN
Name: 291, dtype: object

In [22]:
df[df['CustomerName']=='Nan']

,CustomerID,CustomerName,Gender,Age,Country,OrderID,OrderDate,ProductCategory,ProductName,Price,...,DiscountRate,HasDiscountApplied,TotalAmount,PaymentMethod,DeviceType,ReferralSource,SessionDuration,CustomerTenureDays,ReviewScore,ReviewText
167,C120005,Nan,Male,49.000000,India,O242731,01-12-2024,Clothing,Nike Running Shoes,4023.00000,...,0.0,FALSE,4023.000000,UPI,Mobile,Friend,1101.00000,3.000000,4.000000,NaN
291,C121856,Nan,Male,18.000000,Canada,O204881,04-07-2024,Clothing,Zara Casual Shirt,2176.68000,...,0.0,FALSE,2176.680000,UPI,Mobile,Friend,39.00000,653.000000,1.000000,NaN
557,C123113,Nan,Male,43.000000,UK,O258094,10-07-2024,Clothing,Puma Sports Tee,1040.00000,...,20.0,TRUE,1664.000000,UPI,Tablet,Friend,1509.00000,572.000000,3.000000,NaN
607,C135151,Nan,Male,37.000000,Canada,O251391,24-12-2024,Clothing,H&M Hoodie,1578.15000,...,0.0,FALSE,1578.150000,UPI,Mobile,Organic,105.00000,341.000000,3.000000,Okay product
633,C140142,Nan,Male,19.000000,USA,O297478,27-07-2024,Furniture,Sofa 3-Seater,22521.75000,...,0.0,FALSE,90087.000000,Card,Mobile,Organic,368.00000,275.000000,3.000000,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
100213,C135214,Nan,Female,44.000000,India,O243016,14-10-2024,Clothing,Nike Running Shoes,4267.25000,...,0.0,FALSE,4267.250000,UPI,Mobile,Friend,253.00000,571.000000,5.000000,NaN
100244,C118808,Nan,Male,49.774759,uk,o202911,02-05-2024,electronics,Sony WH-1000XM5 Headphones,11156.36086,...,0.0,False,9264.245465,Card,Mobile,ad,530.53667,239.166188,3.676023,good quality
100295,C149102,Nan,Female,58.000000,USA,O246576,14-06-2024,Clothing,Nike Running Shoes,3131.89000,...,0.0,FALSE,6263.780000,Card,Tablet,Organic,471.00000,218.000000,4.000000,Great product
100299,C109351,Nan,Female,39.000000,USA,O295839,15-08-2024,Clothing,Nike Running Shoes,3389.72000,...,5.0,TRUE,3220.230000,UPI,Mobile,Ad,65.00000,173.000000,1.000000,NaN
100363,C102051,Nan,Male,31.000000,UK,O252992,06-03-2024,Clothing,Nike Running Shoes,3282.69000,...,5.0,TRUE,3118.560000,COD,Desktop,Friend,131.00000,1273.000000,4.000000,Good quality

In [23]:
df['CustomerName'] = df['CustomerName'].replace('Nan', np.nan)

In [24]:
df['CustomerName'].isnull().sum()

np.int64(1001)

In [25]:
df['CustomerName'].fillna('Unknown',inplace=True)

C:\Users\hemen\AppData\Local\Temp\ipykernel_4876\3384984950.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['CustomerName'].fillna('Unknown',inplace=True)

In [26]:
df['CustomerName'].isnull().sum()

np.int64(0)

In [27]:
df[df['CustomerName']=='Unknown']

,CustomerID,CustomerName,Gender,Age,Country,OrderID,OrderDate,ProductCategory,ProductName,Price,...,DiscountRate,HasDiscountApplied,TotalAmount,PaymentMethod,DeviceType,ReferralSource,SessionDuration,CustomerTenureDays,ReviewScore,ReviewText
167,C120005,Unknown,Male,49.000000,India,O242731,01-12-2024,Clothing,Nike Running Shoes,4023.00000,...,0.0,FALSE,4023.000000,UPI,Mobile,Friend,1101.00000,3.000000,4.000000,NaN
291,C121856,Unknown,Male,18.000000,Canada,O204881,04-07-2024,Clothing,Zara Casual Shirt,2176.68000,...,0.0,FALSE,2176.680000,UPI,Mobile,Friend,39.00000,653.000000,1.000000,NaN
557,C123113,Unknown,Male,43.000000,UK,O258094,10-07-2024,Clothing,Puma Sports Tee,1040.00000,...,20.0,TRUE,1664.000000,UPI,Tablet,Friend,1509.00000,572.000000,3.000000,NaN
607,C135151,Unknown,Male,37.000000,Canada,O251391,24-12-2024,Clothing,H&M Hoodie,1578.15000,...,0.0,FALSE,1578.150000,UPI,Mobile,Organic,105.00000,341.000000,3.000000,Okay product
633,C140142,Unknown,Male,19.000000,USA,O297478,27-07-2024,Furniture,Sofa 3-Seater,22521.75000,...,0.0,FALSE,90087.000000,Card,Mobile,Organic,368.00000,275.000000,3.000000,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
100213,C135214,Unknown,Female,44.000000,India,O243016,14-10-2024,Clothing,Nike Running Shoes,4267.25000,...,0.0,FALSE,4267.250000,UPI,Mobile,Friend,253.00000,571.000000,5.000000,NaN
100244,C118808,Unknown,Male,49.774759,uk,o202911,02-05-2024,electronics,Sony WH-1000XM5 Headphones,11156.36086,...,0.0,False,9264.245465,Card,Mobile,ad,530.53667,239.166188,3.676023,good quality
100295,C149102,Unknown,Female,58.000000,USA,O246576,14-06-2024,Clothing,Nike Running Shoes,3131.89000,...,0.0,FALSE,6263.780000,Card,Tablet,Organic,471.00000,218.000000,4.000000,Great product
100299,C109351,Unknown,Female,39.000000,USA,O295839,15-08-2024,Clothing,Nike Running Shoes,3389.72000,...,5.0,TRUE,3220.230000,UPI,Mobile,Ad,65.00000,173.000000,1.000000,NaN
100363,C102051,Unknown,Male,31.000000,UK,O252992,06-03-2024,Clothing,Nike Running Shoes,3282.69000,...,5.0,TRUE,3118.560000,COD,Desktop,Friend,131.00000,1273.000000,4.000000,Good quality

In [28]:
df.loc[df['CustomerName'].str.contains(r'\d',na=False),'CustomerName']=np.nan

In [29]:
df[df['CustomerName']=='Unknown']

,CustomerID,CustomerName,Gender,Age,Country,OrderID,OrderDate,ProductCategory,ProductName,Price,...,DiscountRate,HasDiscountApplied,TotalAmount,PaymentMethod,DeviceType,ReferralSource,SessionDuration,CustomerTenureDays,ReviewScore,ReviewText
167,C120005,Unknown,Male,49.000000,India,O242731,01-12-2024,Clothing,Nike Running Shoes,4023.00000,...,0.0,FALSE,4023.000000,UPI,Mobile,Friend,1101.00000,3.000000,4.000000,NaN
291,C121856,Unknown,Male,18.000000,Canada,O204881,04-07-2024,Clothing,Zara Casual Shirt,2176.68000,...,0.0,FALSE,2176.680000,UPI,Mobile,Friend,39.00000,653.000000,1.000000,NaN
557,C123113,Unknown,Male,43.000000,UK,O258094,10-07-2024,Clothing,Puma Sports Tee,1040.00000,...,20.0,TRUE,1664.000000,UPI,Tablet,Friend,1509.00000,572.000000,3.000000,NaN
607,C135151,Unknown,Male,37.000000,Canada,O251391,24-12-2024,Clothing,H&M Hoodie,1578.15000,...,0.0,FALSE,1578.150000,UPI,Mobile,Organic,105.00000,341.000000,3.000000,Okay product
633,C140142,Unknown,Male,19.000000,USA,O297478,27-07-2024,Furniture,Sofa 3-Seater,22521.75000,...,0.0,FALSE,90087.000000,Card,Mobile,Organic,368.00000,275.000000,3.000000,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
100213,C135214,Unknown,Female,44.000000,India,O243016,14-10-2024,Clothing,Nike Running Shoes,4267.25000,...,0.0,FALSE,4267.250000,UPI,Mobile,Friend,253.00000,571.000000,5.000000,NaN
100244,C118808,Unknown,Male,49.774759,uk,o202911,02-05-2024,electronics,Sony WH-1000XM5 Headphones,11156.36086,...,0.0,False,9264.245465,Card,Mobile,ad,530.53667,239.166188,3.676023,good quality
100295,C149102,Unknown,Female,58.000000,USA,O246576,14-06-2024,Clothing,Nike Running Shoes,3131.89000,...,0.0,FALSE,6263.780000,Card,Tablet,Organic,471.00000,218.000000,4.000000,Great product
100299,C109351,Unknown,Female,39.000000,USA,O295839,15-08-2024,Clothing,Nike Running Shoes,3389.72000,...,5.0,TRUE,3220.230000,UPI,Mobile,Ad,65.00000,173.000000,1.000000,NaN
100363,C102051,Unknown,Male,31.000000,UK,O252992,06-03-2024,Clothing,Nike Running Shoes,3282.69000,...,5.0,TRUE,3118.560000,COD,Desktop,Friend,131.00000,1273.000000,4.000000,Good quality

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100500 entries, 0 to 100499
Data columns (total 21 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   CustomerID          100500 non-null  object
 1   CustomerName        100500 non-null  object
 2   Gender              100500 non-null  object
 3   Age                 100500 non-null  float64
 4   Country             100500 non-null  object
 5   OrderID             100500 non-null  object
 6   OrderDate           100500 non-null  object
 7   ProductCategory     100500 non-null  object
 8   ProductName         99525 non-null   object
 9   Price               100500 non-null  float64
 10  Quantity            100500 non-null  float64
 11  DiscountRate        100500 non-null  float64
 12  HasDiscountApplied  100500 non-null  object
 13  TotalAmount         100500 non-null  float64
 14  PaymentMethod       99490 non-null   object
 15  DeviceType          100500 non-null  object
 16  ReferralSource      100500 non-null  object
 17  SessionDuration     100500 non-null  float64
 18  CustomerTenureDays  100500 non-null  float64
 19  ReviewScore         100500 non-null  float64
 20  ReviewText          41962 non-null   object
dtypes: float64(8), object(13)
memory usage: 16.1+ MB

In [31]:
df['Gender']

0         Female
1           Male
2         Female
3           Male
4         Female
           ...
100495      Male
100496    Female
100497      Male
100498    Female
100499      Male
Name: Gender, Length: 100500, dtype: object

In [32]:
df['Gender'].isnull().sum()

np.int64(0)

In [33]:
df['Gender'].value_counts()

Gender
Male       55972
Female     38564
Other       1878
 Male        619
male         588
Male         584
MALE         579
Female       448
FEMALE       426
 Female      383
female       382
 Other        22
other         21
OTHER         18
Other         16
Name: count, dtype: int64

In [34]:
df['Gender']=df['Gender'].astype(str).str.strip().str.title()

In [35]:
df['Gender'].value_counts()

Gender
Male      58342
Female    40203
Other      1955
Name: count, dtype: int64

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100500 entries, 0 to 100499
Data columns (total 21 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   CustomerID          100500 non-null  object
 1   CustomerName        100500 non-null  object
 2   Gender              100500 non-null  object
 3   Age                 100500 non-null  float64
 4   Country             100500 non-null  object
 5   OrderID             100500 non-null  object
 6   OrderDate           100500 non-null  object
 7   ProductCategory     100500 non-null  object
 8   ProductName         99525 non-null   object
 9   Price               100500 non-null  float64
 10  Quantity            100500 non-null  float64
 11  DiscountRate        100500 non-null  float64
 12  HasDiscountApplied  100500 non-null  object
 13  TotalAmount         100500 non-null  float64
 14  PaymentMethod       99490 non-null   object
 15  DeviceType          100500 non-null  object
 16  ReferralSource      100500 non-null  object
 17  SessionDuration     100500 non-null  float64
 18  CustomerTenureDays  100500 non-null  float64
 19  ReviewScore         100500 non-null  float64
 20  ReviewText          41962 non-null   object
dtypes: float64(8), object(13)
memory usage: 16.1+ MB

In [37]:
df['Age']

0         18.0
1         40.0
2         40.0
3         18.0
4         36.0
          ...
100495    18.0
100496    44.0
100497    47.0
100498    37.0
100499    30.0
Name: Age, Length: 100500, dtype: float64

In [38]:
df['Age'] = pd.to_numeric(df['Age'], errors='coerce').astype('int64')

In [39]:
df['Age']

0         18
1         40
2         40
3         18
4         36
          ..
100495    18
100496    44
100497    47
100498    37
100499    30
Name: Age, Length: 100500, dtype: int64

In [40]:
df.describe()

,Age,Price,Quantity,DiscountRate,TotalAmount,SessionDuration,CustomerTenureDays,ReviewScore
count,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000
mean,32.200428,12969.015061,1.373490,3.732758,16636.518828,322.946302,402.047919,3.629075
std,9.395823,14705.752729,0.799082,5.572621,23898.641885,297.289047,403.322816,1.108081
min,18.000000,255.050000,1.000000,0.000000,204.380000,16.191353,0.000000,0.919006
25%,25.000000,1896.890000,1.000000,0.000000,2085.767500,112.000000,115.000000,3.000000
50%,32.000000,7769.295000,1.000000,0.000000,8025.115000,231.000000,278.000000,4.000000
75%,39.000000,18445.222500,1.000000,5.000000,22620.780000,436.000000,556.000000,4.000000
max,81.000000,74911.034740,5.883613,28.270089,249669.520000,3465.000000,6287.000000,5.000000

In [41]:
df['Age'].isnull().sum()

np.int64(0)

In [42]:
df['Age'].dtype

dtype('int64')

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100500 entries, 0 to 100499
Data columns (total 21 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   CustomerID          100500 non-null  object
 1   CustomerName        100500 non-null  object
 2   Gender              100500 non-null  object
 3   Age                 100500 non-null  int64
 4   Country             100500 non-null  object
 5   OrderID             100500 non-null  object
 6   OrderDate           100500 non-null  object
 7   ProductCategory     100500 non-null  object
 8   ProductName         99525 non-null   object
 9   Price               100500 non-null  float64
 10  Quantity            100500 non-null  float64
 11  DiscountRate        100500 non-null  float64
 12  HasDiscountApplied  100500 non-null  object
 13  TotalAmount         100500 non-null  float64
 14  PaymentMethod       99490 non-null   object
 15  DeviceType          100500 non-null  object
 16  ReferralSource      100500 non-null  object
 17  SessionDuration     100500 non-null  float64
 18  CustomerTenureDays  100500 non-null  float64
 19  ReviewScore         100500 non-null  float64
 20  ReviewText          41962 non-null   object
dtypes: float64(7), int64(1), object(13)
memory usage: 16.1+ MB

In [44]:
df['Country']

0             USA
1             USA
2         Germany
3              UK
4              UK
           ...
100495         UK
100496     Canada
100497      India
100498        USA
100499        USA
Name: Country, Length: 100500, dtype: object

In [45]:
df['Country'].value_counts()

Country
USA          38224
India        28400
UK           14284
Canada        9426
Germany       4781
 USA           759
 India         543
USA            456
 USA           410
usa            399
 INDIA         327
INDIA          318
India          309
 UK            293
india          274
 Canada        184
 UK            150
uk             137
UK             137
 Germany        93
CANADA          91
 CANADA         91
canada          88
Canada          85
Germany         54
 GERMANY        49
GERMANY         45
germany         41
 INDIA           6
  USA            5
 India           4
 usa             4
 CANADA          3
  USA            3
 india           3
 INDIA           2
  UK             2
 uk              2
 USA             2
  India          2
 uk              2
 UK              2
  INDIA          2
  Canada         2
 usa             1
 germany         1
 CANADA          1
  CANADA         1
 canada          1
  UK             1
Name: count, dtype: int64

In [46]:
df['Country']=df['Country'].astype(str).str.strip().str.title()

In [47]:
df['Country'].value_counts()

Country
Usa        40263
India      30190
Uk         15010
Canada      9973
Germany     5064
Name: count, dtype: int64

In [48]:
df['Country'].isnull().sum()

np.int64(0)

In [49]:
df['Country'].dtype

dtype('O')

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100500 entries, 0 to 100499
Data columns (total 21 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   CustomerID          100500 non-null  object
 1   CustomerName        100500 non-null  object
 2   Gender              100500 non-null  object
 3   Age                 100500 non-null  int64
 4   Country             100500 non-null  object
 5   OrderID             100500 non-null  object
 6   OrderDate           100500 non-null  object
 7   ProductCategory     100500 non-null  object
 8   ProductName         99525 non-null   object
 9   Price               100500 non-null  float64
 10  Quantity            100500 non-null  float64
 11  DiscountRate        100500 non-null  float64
 12  HasDiscountApplied  100500 non-null  object
 13  TotalAmount         100500 non-null  float64
 14  PaymentMethod       99490 non-null   object
 15  DeviceType          100500 non-null  object
 16  ReferralSource      100500 non-null  object
 17  SessionDuration     100500 non-null  float64
 18  CustomerTenureDays  100500 non-null  float64
 19  ReviewScore         100500 non-null  float64
 20  ReviewText          41962 non-null   object
dtypes: float64(7), int64(1), object(13)
memory usage: 16.1+ MB

In [51]:
df['OrderID']

0         O278302
1         O266464
2         O293227
3         O201747
4         O280004
           ...
100495    O206265
100496    O254886
100497    O276820
100498    O200860
100499    O215795
Name: OrderID, Length: 100500, dtype: object

In [52]:
df['OrderID']

0         O278302
1         O266464
2         O293227
3         O201747
4         O280004
           ...
100495    O206265
100496    O254886
100497    O276820
100498    O200860
100499    O215795
Name: OrderID, Length: 100500, dtype: object

In [53]:
df['OrderID'] = df['OrderID'].astype(str).str.strip().str.upper()

In [54]:
df['OrderID']

0         O278302
1         O266464
2         O293227
3         O201747
4         O280004
           ...
100495    O206265
100496    O254886
100497    O276820
100498    O200860
100499    O215795
Name: OrderID, Length: 100500, dtype: object

In [55]:
df['OrderID'].isnull().sum()

np.int64(0)

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100500 entries, 0 to 100499
Data columns (total 21 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   CustomerID          100500 non-null  object
 1   CustomerName        100500 non-null  object
 2   Gender              100500 non-null  object
 3   Age                 100500 non-null  int64
 4   Country             100500 non-null  object
 5   OrderID             100500 non-null  object
 6   OrderDate           100500 non-null  object
 7   ProductCategory     100500 non-null  object
 8   ProductName         99525 non-null   object
 9   Price               100500 non-null  float64
 10  Quantity            100500 non-null  float64
 11  DiscountRate        100500 non-null  float64
 12  HasDiscountApplied  100500 non-null  object
 13  TotalAmount         100500 non-null  float64
 14  PaymentMethod       99490 non-null   object
 15  DeviceType          100500 non-null  object
 16  ReferralSource      100500 non-null  object
 17  SessionDuration     100500 non-null  float64
 18  CustomerTenureDays  100500 non-null  float64
 19  ReviewScore         100500 non-null  float64
 20  ReviewText          41962 non-null   object
dtypes: float64(7), int64(1), object(13)
memory usage: 16.1+ MB

In [57]:
df['OrderDate']

0         27-02-2024
1         25-12-2024
2         23-04-2024
3         20-02-2024
4         25-02-2024
             ...
100495    18-06-2024
100496    16-02-2024
100497    25-12-2024
100498    24-12-2024
100499    28-02-2024
Name: OrderDate, Length: 100500, dtype: object

In [58]:
df['OrderDate']=pd.to_datetime(df['OrderDate'],format='%d-%m-%Y',errors='coerce')

In [59]:
df['OrderDate']

0        2024-02-27
1        2024-12-25
2        2024-04-23
3        2024-02-20
4        2024-02-25
            ...
100495   2024-06-18
100496   2024-02-16
100497   2024-12-25
100498   2024-12-24
100499   2024-02-28
Name: OrderDate, Length: 100500, dtype: datetime64[ns]

In [60]:
df['OrderDate'].min(), df['OrderDate'].max()

(Timestamp('2024-01-01 00:00:00'), Timestamp('2024-12-31 00:00:00'))

In [61]:
df['OrderDate'].isnull().sum()

np.int64(201)

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100500 entries, 0 to 100499
Data columns (total 21 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   CustomerID          100500 non-null  object
 1   CustomerName        100500 non-null  object
 2   Gender              100500 non-null  object
 3   Age                 100500 non-null  int64
 4   Country             100500 non-null  object
 5   OrderID             100500 non-null  object
 6   OrderDate           100299 non-null  datetime64[ns]
 7   ProductCategory     100500 non-null  object
 8   ProductName         99525 non-null   object
 9   Price               100500 non-null  float64
 10  Quantity            100500 non-null  float64
 11  DiscountRate        100500 non-null  float64
 12  HasDiscountApplied  100500 non-null  object
 13  TotalAmount         100500 non-null  float64
 14  PaymentMethod       99490 non-null   object
 15  DeviceType          100500 non-null  object
 16  ReferralSource      100500 non-null  object
 17  SessionDuration     100500 non-null  float64
 18  CustomerTenureDays  100500 non-null  float64
 19  ReviewScore         100500 non-null  float64
 20  ReviewText          41962 non-null   object
dtypes: datetime64[ns](1), float64(7), int64(1), object(12)
memory usage: 16.1+ MB

In [63]:
df['ProductCategory']

0            Clothing
1            Clothing
2         Electronics
3         Electronics
4         Electronics
             ...
100495    Electronics
100496       Clothing
100497      Furniture
100498       Clothing
100499    Electronics
Name: ProductCategory, Length: 100500, dtype: object

In [64]:
df['ProductCategory'].value_counts()

ProductCategory
Electronics     33646
Clothing        29251
Furniture       19165
Groceries        9566
Accessories      4816
 Electronics      371
electronics       365
Electronics       362
ELECTRONICS       331
Clothing          324
CLOTHING          303
 Clothing         292
clothing          278
FURNITURE         207
furniture         201
Furniture         198
 Furniture        183
Groceries         116
 Groceries        111
groceries         102
GROCERIES         101
ACCESSORIES        62
accessories        55
 Accessories       53
Accessories        41
Name: count, dtype: int64

In [65]:
df['ProductCategory']=df['ProductCategory'].astype(str).str.strip().str.title()

In [66]:
df['ProductCategory'].value_counts()

ProductCategory
Electronics    35075
Clothing       30448
Furniture      19954
Groceries       9996
Accessories     5027
Name: count, dtype: int64

In [67]:
df['ProductCategory'].isnull().sum()

np.int64(0)

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100500 entries, 0 to 100499
Data columns (total 21 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   CustomerID          100500 non-null  object
 1   CustomerName        100500 non-null  object
 2   Gender              100500 non-null  object
 3   Age                 100500 non-null  int64
 4   Country             100500 non-null  object
 5   OrderID             100500 non-null  object
 6   OrderDate           100299 non-null  datetime64[ns]
 7   ProductCategory     100500 non-null  object
 8   ProductName         99525 non-null   object
 9   Price               100500 non-null  float64
 10  Quantity            100500 non-null  float64
 11  DiscountRate        100500 non-null  float64
 12  HasDiscountApplied  100500 non-null  object
 13  TotalAmount         100500 non-null  float64
 14  PaymentMethod       99490 non-null   object
 15  DeviceType          100500 non-null  object
 16  ReferralSource      100500 non-null  object
 17  SessionDuration     100500 non-null  float64
 18  CustomerTenureDays  100500 non-null  float64
 19  ReviewScore         100500 non-null  float64
 20  ReviewText          41962 non-null   object
dtypes: datetime64[ns](1), float64(7), int64(1), object(12)
memory usage: 16.1+ MB

In [69]:
df['ProductName']

0              Zara Casual Shirt
1              Zara Casual Shirt
2                Apple iPad 10th
3                Apple iPad 10th
4                Apple iPad 10th
                   ...
100495           Apple iPad 10th
100496         Zara Casual Shirt
100497    Office Ergonomic Chair
100498        Nike Running Shoes
100499                 LG TV 43"
Name: ProductName, Length: 100500, dtype: object

In [70]:
df['ProductName'].value_counts()

ProductName
LG TV 43"                     6772
Sony WH-1000XM5 Headphones    6593
Dell Inspiron Laptop          6592
Apple iPad 10th               6527
Samsung Galaxy S23            6482
                              ...
puma sports tee                  1
 PUMA SPORTS TEE                 1
 basmati rice 5kg                1
 lg tv 43"                       1
h&m hoodie                       1
Name: count, Length: 146, dtype: int64

In [71]:
df['ProductName']=df['ProductName'].astype(str).str.strip().str.title()

In [72]:
df['ProductName'].value_counts()

ProductName
Lg Tv 43"                     7052
Sony Wh-1000Xm5 Headphones    6970
Dell Inspiron Laptop          6926
Apple Ipad 10Th               6913
Samsung Galaxy S23            6848
Zara Casual Shirt             6114
Levi Jeans 501                6086
Nike Running Shoes            6011
Puma Sports Tee               6011
H&M Hoodie                    5927
Queen Bed Frame               4001
Sofa 3-Seater                 3975
Ikea Study Table              3975
Wooden Dining Set             3937
Office Ergonomic Chair        3882
Almonds 1Kg                   2060
Basmati Rice 5Kg              2018
Wheat Flour 2Kg               1953
Organic Honey 500G            1932
Olive Oil 1L                  1927
Backpack 20L                  1031
Titan Wristwatch              1019
Nan                           1001
Wireless Charger               998
Sunglasses Polarized           985
Leather Belt                   948
Name: count, dtype: int64

In [73]:
df['ProductName'] = df['ProductName'].replace('Nan', 'Unknown Product')

In [74]:
df['ProductName'].value_counts()

ProductName
Lg Tv 43"                     7052
Sony Wh-1000Xm5 Headphones    6970
Dell Inspiron Laptop          6926
Apple Ipad 10Th               6913
Samsung Galaxy S23            6848
Zara Casual Shirt             6114
Levi Jeans 501                6086
Nike Running Shoes            6011
Puma Sports Tee               6011
H&M Hoodie                    5927
Queen Bed Frame               4001
Sofa 3-Seater                 3975
Ikea Study Table              3975
Wooden Dining Set             3937
Office Ergonomic Chair        3882
Almonds 1Kg                   2060
Basmati Rice 5Kg              2018
Wheat Flour 2Kg               1953
Organic Honey 500G            1932
Olive Oil 1L                  1927
Backpack 20L                  1031
Titan Wristwatch              1019
Unknown Product               1001
Wireless Charger               998
Sunglasses Polarized           985
Leather Belt                   948
Name: count, dtype: int64

In [75]:
df['ProductName'].isnull().sum()

np.int64(0)

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100500 entries, 0 to 100499
Data columns (total 21 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   CustomerID          100500 non-null  object
 1   CustomerName        100500 non-null  object
 2   Gender              100500 non-null  object
 3   Age                 100500 non-null  int64
 4   Country             100500 non-null  object
 5   OrderID             100500 non-null  object
 6   OrderDate           100299 non-null  datetime64[ns]
 7   ProductCategory     100500 non-null  object
 8   ProductName         100500 non-null  object
 9   Price               100500 non-null  float64
 10  Quantity            100500 non-null  float64
 11  DiscountRate        100500 non-null  float64
 12  HasDiscountApplied  100500 non-null  object
 13  TotalAmount         100500 non-null  float64
 14  PaymentMethod       99490 non-null   object
 15  DeviceType          100500 non-null  object
 16  ReferralSource      100500 non-null  object
 17  SessionDuration     100500 non-null  float64
 18  CustomerTenureDays  100500 non-null  float64
 19  ReviewScore         100500 non-null  float64
 20  ReviewText          41962 non-null   object
dtypes: datetime64[ns](1), float64(7), int64(1), object(12)
memory usage: 16.1+ MB

In [77]:
df['Price']

0          2196.74
1          1843.29
2         26148.78
3         29340.19
4         24367.64
            ...
100495    29838.26
100496     1828.11
100497     9024.69
100498     3915.72
100499    15336.55
Name: Price, Length: 100500, dtype: float64

In [78]:
df['Price'].isnull().sum()

np.int64(0)

In [79]:
df['Price'].dtype

dtype('float64')

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100500 entries, 0 to 100499
Data columns (total 21 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   CustomerID          100500 non-null  object
 1   CustomerName        100500 non-null  object
 2   Gender              100500 non-null  object
 3   Age                 100500 non-null  int64
 4   Country             100500 non-null  object
 5   OrderID             100500 non-null  object
 6   OrderDate           100299 non-null  datetime64[ns]
 7   ProductCategory     100500 non-null  object
 8   ProductName         100500 non-null  object
 9   Price               100500 non-null  float64
 10  Quantity            100500 non-null  float64
 11  DiscountRate        100500 non-null  float64
 12  HasDiscountApplied  100500 non-null  object
 13  TotalAmount         100500 non-null  float64
 14  PaymentMethod       99490 non-null   object
 15  DeviceType          100500 non-null  object
 16  ReferralSource      100500 non-null  object
 17  SessionDuration     100500 non-null  float64
 18  CustomerTenureDays  100500 non-null  float64
 19  ReviewScore         100500 non-null  float64
 20  ReviewText          41962 non-null   object
dtypes: datetime64[ns](1), float64(7), int64(1), object(12)
memory usage: 16.1+ MB

In [81]:
df['Quantity']

0         1.0
1         1.0
2         1.0
3         1.0
4         1.0
         ...
100495    1.0
100496    1.0
100497    1.0
100498    4.0
100499    3.0
Name: Quantity, Length: 100500, dtype: float64

In [82]:
df['Quantity'] = pd.to_numeric(df['Quantity'], errors='coerce').fillna(0).astype('int')

In [83]:
df['Quantity']

0         1
1         1
2         1
3         1
4         1
         ..
100495    1
100496    1
100497    1
100498    4
100499    3
Name: Quantity, Length: 100500, dtype: int64

In [84]:
df['Quantity'].isnull().sum()

np.int64(0)

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100500 entries, 0 to 100499
Data columns (total 21 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   CustomerID          100500 non-null  object
 1   CustomerName        100500 non-null  object
 2   Gender              100500 non-null  object
 3   Age                 100500 non-null  int64
 4   Country             100500 non-null  object
 5   OrderID             100500 non-null  object
 6   OrderDate           100299 non-null  datetime64[ns]
 7   ProductCategory     100500 non-null  object
 8   ProductName         100500 non-null  object
 9   Price               100500 non-null  float64
 10  Quantity            100500 non-null  int64
 11  DiscountRate        100500 non-null  float64
 12  HasDiscountApplied  100500 non-null  object
 13  TotalAmount         100500 non-null  float64
 14  PaymentMethod       99490 non-null   object
 15  DeviceType          100500 non-null  object
 16  ReferralSource      100500 non-null  object
 17  SessionDuration     100500 non-null  float64
 18  CustomerTenureDays  100500 non-null  float64
 19  ReviewScore         100500 non-null  float64
 20  ReviewText          41962 non-null   object
dtypes: datetime64[ns](1), float64(6), int64(2), object(12)
memory usage: 16.1+ MB

In [86]:
df['DiscountRate']

0          0.0
1          0.0
2          0.0
3          0.0
4          0.0
          ...
100495     5.0
100496     0.0
100497     5.0
100498     0.0
100499    20.0
Name: DiscountRate, Length: 100500, dtype: float64

In [87]:
df['DiscountRate'] = (
    df['DiscountRate']
    .astype(str)
    .str.replace('%', '', regex=False)  
    .str.strip()
)
df['DiscountRate'] = pd.to_numeric(df['DiscountRate'], errors='coerce')

In [88]:
df['DiscountRate']

0          0.0
1          0.0
2          0.0
3          0.0
4          0.0
          ...
100495     5.0
100496     0.0
100497     5.0
100498     0.0
100499    20.0
Name: DiscountRate, Length: 100500, dtype: float64

In [89]:
df.describe()

,Age,OrderDate,Price,Quantity,DiscountRate,TotalAmount,SessionDuration,CustomerTenureDays,ReviewScore
count,100500.000000,100299,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000
mean,32.200428,2024-07-05 07:42:56.627882752,12969.015061,1.346985,3.732758,16636.518828,322.946302,402.047919,3.629075
min,18.000000,2024-01-01 00:00:00,255.050000,1.000000,0.000000,204.380000,16.191353,0.000000,0.919006
25%,25.000000,2024-04-02 00:00:00,1896.890000,1.000000,0.000000,2085.767500,112.000000,115.000000,3.000000
50%,32.000000,2024-07-04 00:00:00,7769.295000,1.000000,0.000000,8025.115000,231.000000,278.000000,4.000000
75%,39.000000,2024-10-05 00:00:00,18445.222500,1.000000,5.000000,22620.780000,436.000000,556.000000,4.000000
max,81.000000,2024-12-31 00:00:00,74911.034740,5.000000,28.270089,249669.520000,3465.000000,6287.000000,5.000000
std,9.395823,NaN,14705.752729,0.782397,5.572621,23898.641885,297.289047,403.322816,1.108081

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100500 entries, 0 to 100499
Data columns (total 21 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   CustomerID          100500 non-null  object
 1   CustomerName        100500 non-null  object
 2   Gender              100500 non-null  object
 3   Age                 100500 non-null  int64
 4   Country             100500 non-null  object
 5   OrderID             100500 non-null  object
 6   OrderDate           100299 non-null  datetime64[ns]
 7   ProductCategory     100500 non-null  object
 8   ProductName         100500 non-null  object
 9   Price               100500 non-null  float64
 10  Quantity            100500 non-null  int64
 11  DiscountRate        100500 non-null  float64
 12  HasDiscountApplied  100500 non-null  object
 13  TotalAmount         100500 non-null  float64
 14  PaymentMethod       99490 non-null   object
 15  DeviceType          100500 non-null  object
 16  ReferralSource      100500 non-null  object
 17  SessionDuration     100500 non-null  float64
 18  CustomerTenureDays  100500 non-null  float64
 19  ReviewScore         100500 non-null  float64
 20  ReviewText          41962 non-null   object
dtypes: datetime64[ns](1), float64(6), int64(2), object(12)
memory usage: 16.1+ MB

In [91]:
df['HasDiscountApplied']

0         FALSE
1         FALSE
2         FALSE
3         FALSE
4         FALSE
          ...
100495     TRUE
100496    FALSE
100497     TRUE
100498    FALSE
100499     TRUE
Name: HasDiscountApplied, Length: 100500, dtype: object

In [92]:
df['HasDiscountApplied'].value_counts()

HasDiscountApplied
FALSE     59030
TRUE      39457
 False      661
False       558
 True       414
True        380
Name: count, dtype: int64

In [93]:
df['HasDiscountApplied']=df['HasDiscountApplied'].astype(str).str.strip().str.title()

In [94]:
df['HasDiscountApplied'].value_counts()

HasDiscountApplied
False    60249
True     40251
Name: count, dtype: int64

In [95]:
df['HasDiscountApplied'].isnull().sum()

np.int64(0)

In [96]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100500 entries, 0 to 100499
Data columns (total 21 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   CustomerID          100500 non-null  object
 1   CustomerName        100500 non-null  object
 2   Gender              100500 non-null  object
 3   Age                 100500 non-null  int64
 4   Country             100500 non-null  object
 5   OrderID             100500 non-null  object
 6   OrderDate           100299 non-null  datetime64[ns]
 7   ProductCategory     100500 non-null  object
 8   ProductName         100500 non-null  object
 9   Price               100500 non-null  float64
 10  Quantity            100500 non-null  int64
 11  DiscountRate        100500 non-null  float64
 12  HasDiscountApplied  100500 non-null  object
 13  TotalAmount         100500 non-null  float64
 14  PaymentMethod       99490 non-null   object
 15  DeviceType          100500 non-null  object
 16  ReferralSource      100500 non-null  object
 17  SessionDuration     100500 non-null  float64
 18  CustomerTenureDays  100500 non-null  float64
 19  ReviewScore         100500 non-null  float64
 20  ReviewText          41962 non-null   object
dtypes: datetime64[ns](1), float64(6), int64(2), object(12)
memory usage: 16.1+ MB

In [97]:
df['TotalAmount']

0          2196.74
1          1843.29
2         26148.78
3         29340.19
4         24367.64
            ...
100495    28346.35
100496     1828.11
100497     8573.46
100498    15662.88
100499    36807.72
Name: TotalAmount, Length: 100500, dtype: float64

In [98]:
df.describe()

,Age,OrderDate,Price,Quantity,DiscountRate,TotalAmount,SessionDuration,CustomerTenureDays,ReviewScore
count,100500.000000,100299,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000,100500.000000
mean,32.200428,2024-07-05 07:42:56.627882752,12969.015061,1.346985,3.732758,16636.518828,322.946302,402.047919,3.629075
min,18.000000,2024-01-01 00:00:00,255.050000,1.000000,0.000000,204.380000,16.191353,0.000000,0.919006
25%,25.000000,2024-04-02 00:00:00,1896.890000,1.000000,0.000000,2085.767500,112.000000,115.000000,3.000000
50%,32.000000,2024-07-04 00:00:00,7769.295000,1.000000,0.000000,8025.115000,231.000000,278.000000,4.000000
75%,39.000000,2024-10-05 00:00:00,18445.222500,1.000000,5.000000,22620.780000,436.000000,556.000000,4.000000
max,81.000000,2024-12-31 00:00:00,74911.034740,5.000000,28.270089,249669.520000,3465.000000,6287.000000,5.000000
std,9.395823,NaN,14705.752729,0.782397,5.572621,23898.641885,297.289047,403.322816,1.108081

In [99]:
df['PaymentMethod']

0         Netbanking
1         Netbanking
2                UPI
3                UPI
4                UPI
             ...
100495           UPI
100496           UPI
100497           UPI
100498           UPI
100499          Card
Name: PaymentMethod, Length: 100500, dtype: object

In [100]:
df['PaymentMethod']=df['PaymentMethod'].astype(str).str.strip().str.title()

In [101]:
df['PaymentMethod'].value_counts()

PaymentMethod
Upi           59361
Card          20051
Netbanking    11999
Cod            8035
Nan            1043
Na                4
                  3
Null              2
N/A               2
Name: count, dtype: int64

In [102]:
df['PaymentMethod']=df['PaymentMethod'].replace('','Unknown')

In [103]:
df['PaymentMethod'].value_counts()

PaymentMethod
Upi           59361
Card          20051
Netbanking    11999
Cod            8035
Nan            1043
Na                4
Unknown           3
Null              2
N/A               2
Name: count, dtype: int64

In [104]:
df['PaymentMethod']=df['PaymentMethod'].replace('N/A','Unknown')

In [105]:
df['PaymentMethod'].value_counts()

PaymentMethod
Upi           59361
Card          20051
Netbanking    11999
Cod            8035
Nan            1043
Unknown           5
Na                4
Null              2
Name: count, dtype: int64

In [106]:
df['PaymentMethod']=df['PaymentMethod'].replace('Null','Unknown')

In [107]:
df['PaymentMethod'].value_counts()

PaymentMethod
Upi           59361
Card          20051
Netbanking    11999
Cod            8035
Nan            1043
Unknown           7
Na                4
Name: count, dtype: int64

In [108]:
df['PaymentMethod']=df['PaymentMethod'].replace('Na','Unknown')

In [109]:
df['PaymentMethod'].value_counts()

PaymentMethod
Upi           59361
Card          20051
Netbanking    11999
Cod            8035
Nan            1043
Unknown          11
Name: count, dtype: int64

In [110]:
df['PaymentMethod']=df['PaymentMethod'].replace('Nan','Unknown')

In [111]:
df['PaymentMethod'].value_counts()

PaymentMethod
Upi           59361
Card          20051
Netbanking    11999
Cod            8035
Unknown        1054
Name: count, dtype: int64

In [112]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100500 entries, 0 to 100499
Data columns (total 21 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   CustomerID          100500 non-null  object
 1   CustomerName        100500 non-null  object
 2   Gender              100500 non-null  object
 3   Age                 100500 non-null  int64
 4   Country             100500 non-null  object
 5   OrderID             100500 non-null  object
 6   OrderDate           100299 non-null  datetime64[ns]
 7   ProductCategory     100500 non-null  object
 8   ProductName         100500 non-null  object
 9   Price               100500 non-null  float64
 10  Quantity            100500 non-null  int64
 11  DiscountRate        100500 non-null  float64
 12  HasDiscountApplied  100500 non-null  object
 13  TotalAmount         100500 non-null  float64
 14  PaymentMethod       100500 non-null  object
 15  DeviceType          100500 non-null  object
 16  ReferralSource      100500 non-null  object
 17  SessionDuration     100500 non-null  float64
 18  CustomerTenureDays  100500 non-null  float64
 19  ReviewScore         100500 non-null  float64
 20  ReviewText          41962 non-null   object
dtypes: datetime64[ns](1), float64(6), int64(2), object(12)
memory usage: 16.1+ MB

In [113]:
df['DeviceType']

0          Mobile
1          Mobile
2          Mobile
3          Mobile
4          Mobile
           ...
100495     Mobile
100496     Mobile
100497     Mobile
100498    Desktop
100499     Mobile
Name: DeviceType, Length: 100500, dtype: object

In [114]:
df['DeviceType']=df['DeviceType'].astype(str).str.strip().str.title()

In [115]:
df['DeviceType'].value_counts()

DeviceType
Mobile     70404
Desktop    15045
Tablet      9930
Other       5121
Name: count, dtype: int64

In [116]:
df['ReferralSource']

0         Organic
1          Search
2           Email
3              Ad
4          Friend
           ...
100495    Organic
100496     Social
100497     Friend
100498     Social
100499         Ad
Name: ReferralSource, Length: 100500, dtype: object

In [117]:
df['ReferralSource']=df['ReferralSource'].astype(str).str.strip().str.title()

In [118]:
df['ReferralSource'].value_counts()

ReferralSource
Organic    35183
Friend     20112
Ad         15172
Social     15116
Email      10025
Search      4892
Name: count, dtype: int64

In [119]:
df['SessionDuration']

0         970.0
1         240.0
2         233.0
3         163.0
4         149.0
          ...
100495    185.0
100496    204.0
100497    185.0
100498    170.0
100499    135.0
Name: SessionDuration, Length: 100500, dtype: float64

In [120]:
df['SessionDuration'].isnull().sum()

np.int64(0)

In [121]:
df['CustomerTenureDays']

0         423.0
1         917.0
2         560.0
3          91.0
4          11.0
          ...
100495    621.0
100496      8.0
100497     92.0
100498    207.0
100499     45.0
Name: CustomerTenureDays, Length: 100500, dtype: float64

In [122]:
df['ReviewScore']

0         5.0
1         3.0
2         5.0
3         4.0
4         4.0
         ...
100495    5.0
100496    3.0
100497    4.0
100498    3.0
100499    5.0
Name: ReviewScore, Length: 100500, dtype: float64

In [123]:
df['ReviewScore'].value_counts()

ReviewScore
4.000000    33314
3.000000    23939
5.000000    23757
2.000000     9595
1.000000     4870
3.676023     1785
2.757017     1267
4.595029     1216
1.838012      507
0.919006      250
Name: count, dtype: int64

In [124]:
df.loc[df['ReviewScore'] < 1, 'ReviewScore'] = np.nan
df.loc[df['ReviewScore'] > 5, 'ReviewScore'] = np.nan

In [125]:
df['ReviewScore'].value_counts()

ReviewScore
4.000000    33314
3.000000    23939
5.000000    23757
2.000000     9595
1.000000     4870
3.676023     1785
2.757017     1267
4.595029     1216
1.838012      507
Name: count, dtype: int64

In [126]:
df[df['ReviewScore']=='nan']

Empty DataFrame
Columns: [CustomerID, CustomerName, Gender, Age, Country, OrderID, OrderDate, ProductCategory, ProductName, Price, Quantity, DiscountRate, HasDiscountApplied, TotalAmount, PaymentMethod, DeviceType, ReferralSource, SessionDuration, CustomerTenureDays, ReviewScore, ReviewText]
Index: []

[0 rows x 21 columns]

In [127]:
df['ReviewScore'] = df['ReviewScore'].round().clip(lower=1, upper=5)

In [128]:
df['ReviewScore'].value_counts()

ReviewScore
4.0    35099
3.0    25206
5.0    24973
2.0    10102
1.0     4870
Name: count, dtype: int64

In [129]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100500 entries, 0 to 100499
Data columns (total 21 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   CustomerID          100500 non-null  object
 1   CustomerName        100500 non-null  object
 2   Gender              100500 non-null  object
 3   Age                 100500 non-null  int64
 4   Country             100500 non-null  object
 5   OrderID             100500 non-null  object
 6   OrderDate           100299 non-null  datetime64[ns]
 7   ProductCategory     100500 non-null  object
 8   ProductName         100500 non-null  object
 9   Price               100500 non-null  float64
 10  Quantity            100500 non-null  int64
 11  DiscountRate        100500 non-null  float64
 12  HasDiscountApplied  100500 non-null  object
 13  TotalAmount         100500 non-null  float64
 14  PaymentMethod       100500 non-null  object
 15  DeviceType          100500 non-null  object
 16  ReferralSource      100500 non-null  object
 17  SessionDuration     100500 non-null  float64
 18  CustomerTenureDays  100500 non-null  float64
 19  ReviewScore         100250 non-null  float64
 20  ReviewText          41962 non-null   object
dtypes: datetime64[ns](1), float64(6), int64(2), object(12)
memory usage: 16.1+ MB

In [130]:
df['ReviewText']

0                     NaN
1            Okay product
2          Very satisfied
3                     NaN
4                     NaN
               ...
100495      Great product
100496                NaN
100497                NaN
100498    Nothing special
100499                NaN
Name: ReviewText, Length: 100500, dtype: object

In [131]:
df['ReviewText']=df['ReviewText'].astype(str).str.strip().str.title()

In [132]:
df['ReviewText']

0                     Nan
1            Okay Product
2          Very Satisfied
3                     Nan
4                     Nan
               ...
100495      Great Product
100496                Nan
100497                Nan
100498    Nothing Special
100499                Nan
Name: ReviewText, Length: 100500, dtype: object

In [133]:
df['ReviewText'].value_counts()

ReviewText
Nan                   60298
Will Buy Again         4860
Value For Money        4809
Very Satisfied         4793
Great Product          4788
Good Quality           4769
As Expected            2570
Nothing Special        2569
Average                2482
Okay Product           2460
Not As Described       1562
Bad Service            1540
Damaged On Arrival     1502
Poor Quality           1498
Name: count, dtype: int64

In [134]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100500 entries, 0 to 100499
Data columns (total 21 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   CustomerID          100500 non-null  object
 1   CustomerName        100500 non-null  object
 2   Gender              100500 non-null  object
 3   Age                 100500 non-null  int64
 4   Country             100500 non-null  object
 5   OrderID             100500 non-null  object
 6   OrderDate           100299 non-null  datetime64[ns]
 7   ProductCategory     100500 non-null  object
 8   ProductName         100500 non-null  object
 9   Price               100500 non-null  float64
 10  Quantity            100500 non-null  int64
 11  DiscountRate        100500 non-null  float64
 12  HasDiscountApplied  100500 non-null  object
 13  TotalAmount         100500 non-null  float64
 14  PaymentMethod       100500 non-null  object
 15  DeviceType          100500 non-null  object
 16  ReferralSource      100500 non-null  object
 17  SessionDuration     100500 non-null  float64
 18  CustomerTenureDays  100500 non-null  float64
 19  ReviewScore         100250 non-null  float64
 20  ReviewText          100500 non-null  object
dtypes: datetime64[ns](1), float64(6), int64(2), object(12)
memory usage: 16.1+ MB

In [135]:
df['ReviewText'].value_counts()

ReviewText
Nan                   60298
Will Buy Again         4860
Value For Money        4809
Very Satisfied         4793
Great Product          4788
Good Quality           4769
As Expected            2570
Nothing Special        2569
Average                2482
Okay Product           2460
Not As Described       1562
Bad Service            1540
Damaged On Arrival     1502
Poor Quality           1498
Name: count, dtype: int64

In [138]:
df.duplicated().sum()

np.int64(0)

In [139]:
df.duplicated(subset=['OrderID']).sum()

np.int64(500)

In [140]:
df.drop_duplicates(inplace=True)

In [142]:
df.drop_duplicates(subset=['OrderID'], keep='first', inplace=True)

In [143]:
df.duplicated(subset=['OrderID']).sum()

np.int64(0)

In [144]:
df.to_csv("ecommerce_cleaned.csv", index=False)